# Importing Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# Importing Dataframes

In [2]:
# Folder path
path = r'/Users/madelinegamache/Documents/InstaCart Basket Analysis'

### Task 4.6 Step 3

In [3]:
# Importing orders_products_combined.csv dataframe
df_ords_prods_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [4]:
# Importing products_checked.csv dataframe
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

In [5]:
# Checking the output for df_ords_prods_combined
df_ords_prods_combined.head()

,Unnamed: 0,order_id,user_id,order_number,weekday_order_placed,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [6]:
# Checking output for df_prods
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [7]:
# Dropping duplicated index column
df_ords_prods_combined = df_ords_prods_combined.drop(columns = ['Unnamed: 0'])

In [8]:
df_ords_prods_combined.head()

,order_id,user_id,order_number,weekday_order_placed,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [9]:
# Dropping duplicated index column
df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [10]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

### Task 4.6 Step 4

In [11]:
df_ords_prods_combined.shape

(32434489, 10)

In [12]:
df_prods.shape

(49672, 5)

### Task 4.6 Step 5

In [13]:
# Column "product_id" is found in both dataframes

In [15]:
# Drop the '_merge' column from the dataframe ords_prods_combined
df_ords_prods_combined = df_ords_prods_combined.drop(columns = ['_merge'])

In [16]:
# Merge df_ords_prods_combined with df_prods
df_merged = df_ords_prods_combined.merge(df_prods, on = 'product_id', indicator = True)

In [17]:
# Checking the output
df_merged.head()

,order_id,user_id,order_number,weekday_order_placed,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [18]:
df_merged.shape

(32404859, 14)

### Task 4.6 Step 6

In [19]:
# Checking the values in the _merge column
df_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

### Task 4.6 Step 7

In [20]:
# Export df_merged as orders_products_merged
df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))